# -*- coding: utf-8 -*-

from ctypes import *
import logging

ex_table = {
        0x8000: '用户交互时异常',
        0x8001: '语音对讲异常',
        0x8002: '报警异常',
        0x8003: '网络预览异常',
        0x8004: '透明通道异常',
        0x8005: '预览时重连',
        0x8006: '报警时重连',
        0x8007: '透明通道重连',
        0x8008: '透明通道重连成功',
        0x8010: '回放异常',
        0x8011: '硬盘格式化',
        0x8012: '被动解码异常',
        0x8013: '邮件测试异常',
        0x8014: '备份异常',
        0x8015: '预览时重连成功',
        0x8016: '报警时重连成功',
        0x8017: '用户交互恢复',
        0x8018: '网络流量检测异常',
        0x8019: '图片预览重连',
        0x8020: '图片预览重连成功',
        0x8021: '图片预览异常',
        0x8022: '报警信息缓存已达上限',
        0x8023: '报警丢失',
        0x8024: '被动转玛重连',
        0x8025: '被动转玛重连成功',
        0x8026: '被动转玛异常',
        0x8040: '用户重登陆',
        0x8041: '用户重登陆成功',
        0x8042: '被动解码重连',
        0x8043: '集群报警异常',
        0x8044: '重登陆失败，停止重登陆',
        0x8045: '关闭预览重连功能',
        0x8046: '关闭报警重连功能',
        0x8047: '关闭透明通道重连功能',
        0x8048: '关闭回显重连功能',
        0x8049:'关闭被动解码重连功能' ,
        0x804a: '关闭被动转玛重连功能',
        }

@CFUNCTYPE(None, c_uint, c_int, c_int, c_void_p)
def excallback(exType, userID, handle, userData):
    if exType in ex_table:
        logging.info("收到回调信息：%s", ex_table[exType])
    else:
        logging.error("收到未知回调信息：0x%x", exType)
